In [783]:
%matplotlib inline
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = (11, 5)  #set default figure size
import numpy as np
from numpy import exp
from scipy.special import factorial
import pandas as pd
from mpl_toolkits.mplot3d import Axes3D
import statsmodels.api as sm
from statsmodels.api import Poisson
from scipy import stats
from scipy.stats import norm
from scipy.stats import poisson
from statsmodels.iolib.summary2 import summary_col
from scipy.optimize import minimize
import mpmath
import math
from math import e
from math import gamma
import warnings
warnings.filterwarnings("ignore")
import scipy.stats as s

<b> Part 1

<b> 1. The Poisson Model
Consider the example related to billboard exposures from class. The associated data is in the file billboard.csv.
Write code to estimate the parameters of the Poisson model using maximum likelihood estimation (MLE).
Report your code, the estimated parameters and the maximum value of the log-likelihood.

In [265]:
df=pd.read_csv(r'C:\Users\cheta\Downloads\billboard.csv')
df

    EXPOSURES  PEOPLE
0           0      48
1           1      37
2           2      30
3           3      24
4           4      20
5           5      16
6           6      13
7           7      11
8           8       9
9           9       7
10         10       6
11         11       5
12         12       5
13         13       3
14         14       3
15         15       2
16         16       2
17         17       2
18         18       1
19         19       1
20         20       2
21         21       1
22         22       1
23         23       1

In [266]:
params=0.1

In [267]:
inputs=df.copy()
inputs

    EXPOSURES  PEOPLE
0           0      48
1           1      37
2           2      30
3           3      24
4           4      20
5           5      16
6           6      13
7           7      11
8           8       9
9           9       7
10         10       6
11         11       5
12         12       5
13         13       3
14         14       3
15         15       2
16         16       2
17         17       2
18         18       1
19         19       1
20         20       2
21         21       1
22         22       1
23         23       1

In [268]:
poisson_pmf = lambda k,l: k*np.log(l)-l*(np.log(e))-np.log(factorial(k))

In [269]:

def LL(params,inputs):
    lambda0=params
    e=inputs['EXPOSURES']
    p=inputs['PEOPLE']
    sum=0
    for i in range(len(inputs)):
        sum+=poisson_pmf(e[i],lambda0)*p[i]
    return sum

In [270]:
def NLL(params, inputs):
    return(-(LL(params, inputs)))

In [271]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None)],
        tol=1e-10,
        options={'ftol' : 1e-8},)

In [272]:
final

      fun: array([929.04388273])
 hess_inv: <1x1 LbfgsInvHessProduct with dtype=float64>
      jac: array([-2.27373677e-05])
  message: 'CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH'
     nfev: 24
      nit: 10
     njev: 12
   status: 0
  success: True
        x: array([4.45599937])

In [273]:
print("The Value for Lambda is ",final.x[0],". The Value of Maximum Log likelihood is ",-1*final.fun[0] )

The Value for Lambda is  4.455999368640959 . The Value of Maximum Log likelihood is  -929.0438827273031

<b>2. The NBD Model
Next, write code (for the same dataset) to estimate the parameters of the NBD model using MLE. Report
your code, the estimated parameters and the maximum value of the log-likelihood. Evaluate the NBD model
vis-`a-vis the Poisson model; explain which is better and why.

In [340]:
params = np.array([0.1,0.1])

In [341]:
df=pd.read_csv(r'C:\Users\cheta\Downloads\billboard.csv')
df
inputs=df.copy()
inputs

    EXPOSURES  PEOPLE
0           0      48
1           1      37
2           2      30
3           3      24
4           4      20
5           5      16
6           6      13
7           7      11
8           8       9
9           9       7
10         10       6
11         11       5
12         12       5
13         13       3
14         14       3
15         15       2
16         16       2
17         17       2
18         18       1
19         19       1
20         20       2
21         21       1
22         22       1
23         23       1

In [342]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [347]:
def NBDLL(params,inputs):
    e=inputs['EXPOSURES']
    p=inputs['PEOPLE']
    n=params[0]
    alpha=params[1]
    sum=0
    for i in range(len(inputs)):
        sum+=pmf_nbd(alpha,n,e[i],1)*p[i]
    return sum

In [348]:
def NLL(params, inputs):
    return(-(NBDLL(params, inputs)))

In [351]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None),(0.000001, None)])

In [352]:
final

      fun: 649.6888274836756
 hess_inv: <2x2 LbfgsInvHessProduct with dtype=float64>
      jac: array([ 6.82121023e-05, -3.41060513e-04])
  message: 'CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH'
     nfev: 42
      nit: 13
     njev: 14
   status: 0
  success: True
        x: array([0.96925927, 0.21751771])

In [353]:
print("The Value for n is ",final.x[0]," and Alpha is ",final.x[1],".The Value of Maximum Log likelihood is ",-1*final.fun )

The Value for n is  0.9692592676813033  and Alpha is  0.21751770719953603 .The Value of Maximum Log likelihood is  -649.6888274836756

<b> 3. The Poisson Regression
Now consider the khakichinos.com example from class; The associated data is in the file khakichinos.csv.
Estimate all relevant parameters for Poisson regression using MLE. Report your code, the estimated parameters and the maximum value of the log-likelihood.

In [302]:
kc=pd.read_csv(r'C:\Users\cheta\Downloads\khakichinos.csv')
kc.drop(['ID'],axis=1,inplace=True)
inputs=kc.copy()

In [303]:
inputs

      NumberofVisits      LnInc  Sex     LnAge  HHSize
0                  0  11.379394    1  3.871201       2
1                  5   9.769956    1  4.043051       1
2                  0  11.082143    0  3.332205       2
3                  0  10.915088    1  3.951244       3
4                  0  10.915088    1  2.833213       3
...              ...        ...  ...       ...     ...
2723               0   9.528794    1  2.944439       2
2724               0  11.379394    0  3.970292       2
2725               0  11.191342    1  3.044522       3
2726               0  10.532096    1  2.890372       4
2727               0  11.736069    1  2.833213       3

[2728 rows x 5 columns]

In [305]:
poisson_pmf = lambda k,l: k*np.log(l)-l*(np.log(e))-np.log(factorial(k))

In [306]:
params = np.array([0.01,0.01,0.1,0.01,0.01])

In [308]:
def LL(params,inputs):
    k=inputs['NumberofVisits'].tolist()
    kc1=inputs.drop(['NumberofVisits'],axis=1)
    a=kc1.to_numpy().tolist()
    beta=params
    lambda0=beta[4]
    beta=np.delete(beta, [4])
    lambdai=0
    sum2=0
    sum1=0
    
    for i in range(len(a)):
        sum1=0
        for j in range(len(a[i])):
            sum1=sum1+beta[j]*a[i][j]
        lambdai=lambda0*np.exp(sum1)
        sum2=sum2+poisson_pmf(k[i],lambdai)
    return sum2

In [309]:
def NegLL(params, inputs):
    return(-(LL(params, inputs)))

In [310]:
final=minimize(NegLL,
         args=inputs,
         x0=params,
         bounds=[(None, None), (None, None), (None, None), (None, None), (0.000001, None)])

In [311]:
print("The Value for lambda is ",final.x[4],"Beta parameters are ",final.x[0:4],".The Value of Maximum Log likelihood is ",-1*final.fun )

The Value for lambda is  0.043843803145908994 Beta parameters are  [ 0.09383211  0.00427661  0.58845273 -0.03590396] .The Value of Maximum Log likelihood is  -6291.49675885234

<b> 4. The NBD Regression
Consider the khakichinos.com example again. Estimate all relevant parameters for NBD Regression using
MLE. Report your code, the estimated parameters and the maximum value of the log-likelihood. Evaluate the
NBD regression vis-`a-vis the Poisson regression; explain which is better and why.

In [323]:
kc=pd.read_csv(r'C:\Users\cheta\Downloads\khakichinos.csv')
kc.drop(['ID'],axis=1,inplace=True)
inputs=kc.copy()

In [324]:
params = np.array([0.1,0.1,0.1,0.1,0.1,0.1])

In [330]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [331]:
def NBDLL(params,inputs):
    k=inputs['NumberofVisits'].tolist()
    kc1=inputs.drop(['NumberofVisits'],axis=1)
    a=kc1.to_numpy().tolist()
    beta=params
    alpha=beta[5]
    n=beta[4]
    beta=np.delete(beta, [4])
    beta=np.delete(beta, [4])
    lambdai=0
    sum2=0
    sum1=0
    for i in range(len(a)):
        sum1=0
        for j in range(len(a[i])):
            sum1=sum1+beta[j]*a[i][j]
        t=math.exp(sum1)
        sum2=sum2+pmf_nbd(alpha,n,k[i],t)
    return sum2

In [332]:
def NegLL(params, inputs):
    return(-(NBDLL(params, inputs)))

In [333]:
final=minimize(NegLL,
         args=inputs,
         x0=params,
         bounds=[(None, None), (None, None), (None, None), (None, None), (0.000001, None),(0.000001, None)])

In [334]:
print("The Value for n is ",final.x[4]," and Alpha is ",final.x[5])
print("The values for the beta parameters are",final.x[0:4])
print("The Value of Maximum Log likelihood is ",-1*final.fun)

The Value for n is  0.13875675766248502  and Alpha is  8.197058003322073
The values for the beta parameters are [ 0.07347589 -0.00919222  0.90195373 -0.02435738]
The Value of Maximum Log likelihood is  -2888.96611657162

<b>Part - 2

<b>1. Read books.csv and generate two new datasets –
<br>(a) books01.csv, with the structure of the dataset used in the billboard exposures example (i.e., with
only two columns – (i) the number purchases, and (ii) the number of people making the corresponding
number of purchases), and

In [404]:
bk=pd.read_csv(r'C:\Users\cheta\Downloads\books.csv')

In [405]:
bk.loc[bk["domain"] == "amazon.com", "qty"] =0

In [406]:
bk

,userid,education,region,hhsz,age,income,child,race,country,domain,date,product,qty,price
0,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,LEONARD WOOLF A BIOGRAPHY BOOKS VICTORIA GLEND...,0,19.80
1,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,THE VIEW FROM CASTLE ROCK STORIES BOOKS ALICE ...,0,17.13
2,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,WILLIAM JAMES IN THE MAELSTROM OF AMERICAN MOD...,0,19.80
3,11519009,NaN,2.0,3,5.0,3,1,2,0,amazon.com,20070101,DRIVEN,0,2.00
4,11519009,NaN,2.0,3,5.0,3,1,2,0,amazon.com,20070101,CHOCOLATE COVERED FORBIDDEN FRUIT,0,3.88
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40940,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,"YOUR HEALTH TODAY, BRIEF: CHOICES IN A CHANGIN...",0,49.38
40941,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,THE PIANO LESSON,0,3.50
40942,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,"THE ESSENTIAL BOGOSIAN: TALK RADIO, DRINKING I...",0,2.65
40943,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,CAT ON A HOT TIN ROOF,0,5.00
40944,15562604,NaN,3.0,2,11.0,6,0,1,0,amazon.com,20071231,HOW THE IRISH SAVED CIVILIZATION (HINGES OF HI...,0,2.86

In [407]:
bk1=bk.groupby('userid', as_index=False).agg({'qty':'sum'})

In [408]:
bk1=bk1.groupby('qty',as_index=False).agg({'userid':'count'})

In [409]:
bk1.to_csv('Book1.csv')

In [410]:
bk1.columns=['Qty_Purchased','Number_of_People']

In [411]:
bk1

    Qty_Purchased  Number_of_People
0               0              7639
1               1               753
2               2               362
3               3               175
4               4               126
5               5                82
6               6                74
7               7                30
8               8                48
9               9                31
10             10                20
11             11                12
12             12                12
13             13                11
14             14                 3
15             15                 6
16             16                 8
17             17                 4
18             18                 1
19             19                 5
20             20                 3
21             21                 6
22             23                 3
23             24                 1
24             27                 3
25             28                 5
26             29                 2
27             30                 3
28             31                 1
29             32                 1
30             33                 1
31             34                 3
32             35                 1
33             37                 2
34             39                 2
35             43                 2
36             46                 1
37             47                 1
38             50                 1
39             56                 1
40             58                 1
41             62                 1
42             63                 1
43             83                 1
44             86                 1
45            111                 1

In [412]:
bk1.head()

   Qty_Purchased  Number_of_People
0              0              7639
1              1               753
2              2               362
3              3               175
4              4               126

In [413]:
bk1.tail()

    Qty_Purchased  Number_of_People
41             62                 1
42             63                 1
43             83                 1
44             86                 1
45            111                 1

<b> (b) books02.csv, with the structure of the dataset used in the khakichinos.com example, with a new column
containing a count of the number of books purchased from barnesandnoble.com by each customer, while
keeping the demographic variables (remember to drop date, product, and price).

In [650]:
bk

,userid,education,region,hhsz,age,income,child,race,country,domain,date,product,qty,price,Common_flag
0,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,LEONARD WOOLF A BIOGRAPHY BOOKS VICTORIA GLEND...,0,19.80,1
1,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,THE VIEW FROM CASTLE ROCK STORIES BOOKS ALICE ...,0,17.13,1
2,11443031,4.0,1.0,2,11.0,4,1,1,0,amazon.com,20070101,WILLIAM JAMES IN THE MAELSTROM OF AMERICAN MOD...,0,19.80,1
3,11519009,NaN,2.0,3,5.0,3,1,2,0,amazon.com,20070101,DRIVEN,0,2.00,1
4,11519009,NaN,2.0,3,5.0,3,1,2,0,amazon.com,20070101,CHOCOLATE COVERED FORBIDDEN FRUIT,0,3.88,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40940,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,"YOUR HEALTH TODAY, BRIEF: CHOICES IN A CHANGIN...",0,49.38,1
40941,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,THE PIANO LESSON,0,3.50,1
40942,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,"THE ESSENTIAL BOGOSIAN: TALK RADIO, DRINKING I...",0,2.65,1
40943,15557019,NaN,2.0,3,6.0,6,1,1,0,amazon.com,20071231,CAT ON A HOT TIN ROOF,0,5.00,1
40944,15562604,NaN,3.0,2,11.0,6,0,1,0,amazon.com,20071231,HOW THE IRISH SAVED CIVILIZATION (HINGES OF HI...,0,2.86,1

In [651]:
#Creating two separate tables for each domain. 
#This is done to make sure we dont miss the users from amazon who did not purchase from barnes and noble 
bk_barnes = bk.loc[bk['domain']== 'barnesandnoble.com']
bk_amazon=  bk.loc[bk['domain']== 'amazon.com']

In [652]:
#Removing product , date , price and domain columns from the tables
bk_barnes.drop(['product','date','price','domain'],axis=1,inplace=True)
bk_amazon.drop(['product','date','price','domain'],axis=1,inplace=True)

In [653]:
#Grouping by the indpendent variables and aggregating the qty
bk_barnes=bk_barnes.groupby(['userid','education','region','hhsz','age','income','child','race','country'],dropna=False,as_index=False).agg({'qty':'sum'})

In [654]:
#Grouping by the indpendent variables and aggregating the qty
bk_amazon=bk_amazon.groupby(['userid','education','region','hhsz','age','income','child','race','country'],dropna=False,as_index=False).agg({'qty':'sum'})

In [655]:
#creating a flag column with a dummy value. this is needed to find the users who bought from both the domains.
#Such users need to be counted in Barnes and noble table but not in amazon
bk['Common_flag']=0

In [656]:
# Adding separate flags for amazon and barnes and noble
bk.loc[bk["domain"] == "amazon.com", "Common_flag"] =1 
bk.loc[bk["domain"] == "barnesandnoble.com", "Common_flag"] =2

In [657]:
# Aggregating the flag column using mean. 
# This is done to be able to identify common users between two domains.
# Users who only bought from amazon will have flag as 1 and users who only bought from barnesandnoble will have 2 as flag after taking the mean
# Users who have bought from both amazon and barnes and noble will have a mean of flag between 1 and 2 

bk_flag=bk.groupby(['userid'],as_index=False).agg({'Common_flag':'mean'})

In [658]:
#creating a separate table with users information where flag value lies between 1 and 2
# this results in a dataframe which has common users from both domains
diff=bk_flag.loc[(bk_flag['Common_flag'] > 1) & (bk_flag['Common_flag'] < 2)]
diff.drop(['Common_flag'],axis=1,inplace=True)
#adding another flag for ease of use.
diff['flag']='T'

In [659]:
diff

        userid flag
0      6365661    T
18     9573834    T
19     9576277    T
21     9581009    T
35     9752844    T
...        ...  ...
9345  15676745    T
9364  15680846    T
9398  15688844    T
9427  15695968    T
9434  15698055    T

[534 rows x 2 columns]

In [660]:
#joining the common users from previous analysis with the Amazon users table using a left join
bk_amazon=pd.merge(bk_amazon,diff,how='left',on='userid')

In [661]:
bk_amazon

,userid,education,region,hhsz,age,income,child,race,country,qty,flag
0,6365661,5.0,1.0,2,11.0,7,0,1,0,0,T
1,6388054,2.0,4.0,1,6.0,5,0,1,0,0,NaN
2,6421559,5.0,4.0,4,5.0,6,0,1,0,0,NaN
3,6467806,NaN,2.0,2,6.0,3,0,1,0,0,NaN
4,6628110,4.0,4.0,5,4.0,7,1,1,0,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
8168,15701290,NaN,1.0,2,3.0,3,0,1,0,0,NaN
8169,15701618,NaN,2.0,3,7.0,2,0,1,0,0,NaN
8170,15701673,NaN,4.0,5,5.0,3,1,1,1,0,NaN
8171,15701704,NaN,3.0,3,5.0,7,1,1,0,0,NaN
8172,15702107,NaN,2.0,2,6.0,1,0,1,0,0,NaN

In [662]:
# Removing all common users in amazon table using the flag
bk_amazon=bk_amazon.loc[bk_amazon["flag"] != "T"]

In [663]:
#doing a union between amazon and barnes and noble data set
bk2=pd.concat([bk_amazon,bk_barnes])
bk2.drop(['flag'],axis=1,inplace=True)

In [664]:
#Final table contains 9451 rows and 10 columns
bk2

,userid,education,region,hhsz,age,income,child,race,country,qty
1,6388054,2.0,4.0,1,6.0,5,0,1,0,0
2,6421559,5.0,4.0,4,5.0,6,0,1,0,0
3,6467806,NaN,2.0,2,6.0,3,0,1,0,0
4,6628110,4.0,4.0,5,4.0,7,1,1,0,0
5,6631403,5.0,3.0,1,10.0,3,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...
1807,15695968,1.0,2.0,5,10.0,2,1,1,0,5
1808,15696910,NaN,3.0,4,8.0,4,1,1,0,2
1809,15698055,NaN,3.0,4,4.0,4,1,1,0,9
1810,15698341,NaN,4.0,6,8.0,6,1,1,0,2
1811,15698605,NaN,4.0,1,11.0,2,0,1,0,1

<b> Displaying the head and tail of the resulting dataset book2 after transformation.

In [634]:
bk2.head()

    userid  education  region  hhsz   age  income  child  race  country  qty
1  6388054        2.0     4.0     1   6.0       5      0     1        0    0
2  6421559        5.0     4.0     4   5.0       6      0     1        0    0
3  6467806        NaN     2.0     2   6.0       3      0     1        0    0
4  6628110        4.0     4.0     5   4.0       7      1     1        0    0
5  6631403        5.0     3.0     1  10.0       3      0     1        1    0

In [635]:
bk2.tail()

,userid,education,region,hhsz,age,income,child,race,country,qty
1807,15695968,1.0,2.0,5,10.0,2,1,1,0,5
1808,15696910,NaN,3.0,4,8.0,4,1,1,0,2
1809,15698055,NaN,3.0,4,4.0,4,1,1,0,9
1810,15698341,NaN,4.0,6,8.0,6,1,1,0,2
1811,15698605,NaN,4.0,1,11.0,2,0,1,0,1

<b>2. Develop a Poisson model using books01.csv. Report your code, the estimated parameters and the maximum
value of the log-likelihood (and any other information you believe is relevant).

In [779]:
inputs=bk1.copy()
inputs

    Qty_Purchased  Number_of_People
0               0              7639
1               1               753
2               2               362
3               3               175
4               4               126
5               5                82
6               6                74
7               7                30
8               8                48
9               9                31
10             10                20
11             11                12
12             12                12
13             13                11
14             14                 3
15             15                 6
16             16                 8
17             17                 4
18             18                 1
19             19                 5
20             20                 3
21             21                 6
22             23                 3
23             24                 1
24             27                 3
25             28                 5
26             29                 2
27             30                 3
28             31                 1
29             32                 1
30             33                 1
31             34                 3
32             35                 1
33             37                 2
34             39                 2
35             43                 2
36             46                 1
37             47                 1
38             50                 1
39             56                 1
40             58                 1
41             62                 1
42             63                 1
43             83                 1
44             86                 1
45            111                 1

In [637]:
poisson_pmf = lambda k,l: k*np.log(l)-l*(np.log(e))-np.log(factorial(k))

In [638]:
params=0.1

In [639]:
inputs.columns=['Qty_Purchased','Number_of_People']

In [640]:
def LL(params,inputs):
    lambda0=params
    e=inputs['Qty_Purchased']
    p=inputs['Number_of_People']
    sum=0
    for i in range(len(inputs)):
        sum+=poisson_pmf(e[i],lambda0)*p[i]
    return sum

In [641]:
def NLL(params, inputs):
    return(-(LL(params, inputs)))

In [642]:
def p_callback(params):
    print(params)

In [643]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None)],callback=p_callback)

[1.1]
[0.86518938]
[0.69368856]
[0.75703656]
[0.74911788]
[0.74848505]
[0.7484922]

In [644]:
print("The estimated value for lambda is ",final.x) 
print("The value of Maximum Log likelihood is ",-1*final.fun)

The estimated value for lambda is  [0.7484922]
The value of Maximum Log likelihood is  [-18921.91842943]

<b>3. Develop a Poisson model using books02.csv, i.e., by ignoring the independent variables available. Report
your code, and confirm that the estimated parameters and the maximum value of the log-likelihood are identical
to those obtained with the Poisson model developed using books01.csv.

In [665]:
bk2.drop(['userid'],axis=1,inplace=True)

In [666]:
bk2

      education  region  hhsz   age  income  child  race  country  qty
1           2.0     4.0     1   6.0       5      0     1        0    0
2           5.0     4.0     4   5.0       6      0     1        0    0
3           NaN     2.0     2   6.0       3      0     1        0    0
4           4.0     4.0     5   4.0       7      1     1        0    0
5           5.0     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807        1.0     2.0     5  10.0       2      1     1        0    5
1808        NaN     3.0     4   8.0       4      1     1        0    2
1809        NaN     3.0     4   4.0       4      1     1        0    9
1810        NaN     4.0     6   8.0       6      1     1        0    2
1811        NaN     4.0     1  11.0       2      0     1        0    1

[9451 rows x 9 columns]

In [667]:
inputs=bk2.copy()

In [696]:
params = 1

In [706]:
def LL(params,inputs):
    k=inputs['qty'].tolist()
    lambda0=params
    sum1=0
    for i in range(len(k)):
        sum1=sum1+(poisson_pmf(k[i],lambda0))
    return sum1

In [707]:
def NLL(params, inputs):
    return(-1*(LL(params, inputs)))

In [708]:
inputs[:3]

   education  region  hhsz  age  income  child  race  country  qty
1        2.0     4.0     1  6.0       5      0     1        0    0
2        5.0     4.0     4  5.0       6      0     1        0    0
3        NaN     2.0     2  6.0       3      0     1        0    0

In [709]:
LL(params,inputs)

-19249.61978239895

In [711]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None)],callback=p_callback)

[0.66011651]
[0.77819378]
[0.75199981]
[0.74835226]
[0.7484935]
[0.7484913]

In [712]:
final

      fun: array([18921.91842944])
 hess_inv: <1x1 LbfgsInvHessProduct with dtype=float64>
      jac: array([-0.02073648])
  message: 'CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH'
     nfev: 16
      nit: 6
     njev: 8
   status: 0
  success: True
        x: array([0.7484913])

In [715]:
print("The estimated value for lambda is ",final.x[0])
print("The Value of Maximum Log likelihood is ",-1*final.fun)
print("We get the same values as the previous question")

The estimated value for lambda is  0.7484913027336835
The Value of Maximum Log likelihood is  [-18921.91842944]
We get the same values as the previous question

<b>4. Develop an NBD model using books01.csv. Report your code, the estimated parameters and the maximum
value of the log-likelihood (and any other information you believe is relevant).

In [740]:
params = np.array([1,1])

In [741]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [742]:
bk1

    Qty_Purchased  Number_of_People
0               0              7639
1               1               753
2               2               362
3               3               175
4               4               126
5               5                82
6               6                74
7               7                30
8               8                48
9               9                31
10             10                20
11             11                12
12             12                12
13             13                11
14             14                 3
15             15                 6
16             16                 8
17             17                 4
18             18                 1
19             19                 5
20             20                 3
21             21                 6
22             23                 3
23             24                 1
24             27                 3
25             28                 5
26             29                 2
27             30                 3
28             31                 1
29             32                 1
30             33                 1
31             34                 3
32             35                 1
33             37                 2
34             39                 2
35             43                 2
36             46                 1
37             47                 1
38             50                 1
39             56                 1
40             58                 1
41             62                 1
42             63                 1
43             83                 1
44             86                 1
45            111                 1

In [743]:
inputs=bk1.copy()

In [744]:
def NBDLL(params,inputs):
    e=inputs['Qty_Purchased']
    p=inputs['Number_of_People']
    n=params[0]
    alpha=params[1]
    sum=0
    for i in range(len(inputs)):
        sum+=(pmf_nbd(alpha,n,e[i],1))*p[i]
    return sum

In [745]:
def NLL(params, inputs):
    return(-(NBDLL(params, inputs)))

In [746]:
def p_callback(params):
    print(params)

In [747]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None),(0.000001, None)],callback=p_callback)

[0.9996994  1.35725779]
[0.14907399 0.40179165]
[0.0979495 0.2639978]
[0.08217807 0.22148967]
[0.08139086 0.21936793]
[0.08134365 0.2192407 ]
[0.08134119 0.21923405]

In [748]:
print("The Value for n is ",final.x[0]," and Alpha is ",final.x[1])
print("The Value of Maximum Log likelihood is ",-1*final.fun)

The Value for n is  0.08134118622615552  and Alpha is  0.21923404867443047
The Value of Maximum Log likelihood is  -8603.49884703562

<b>5. Develop an NBD model using books02.csv (again, ignoring the variables available). Report your code, and
confirm that the estimated parameters and the maximum value of the log-likelihood are identical to those
obtained with the NBD model developed using books01.csv.
2

In [721]:
inputs=bk2.copy()

In [722]:
params = np.array([1,1])

In [723]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [735]:
def NBDLL(params,inputs):
    k=inputs['qty'].tolist()
    kc1=inputs.drop(['qty'],axis=1)
    beta=params
    alpha=beta[1]
    n=beta[0]
    sum1=0
    for i in range(len(k)):
        sum1=sum1+pmf_nbd(alpha,n,k[i],1)
    return sum1

In [736]:
def NegLL(params, inputs):
    return(-(NBDLL(params, inputs)))

In [737]:
final=minimize(NegLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None),(0.000001, None)]
              ,callback=p_callback)

[0.99969942 1.35725546]
[0.14906563 0.401912  ]
[0.0979436  0.26407576]
[0.08216343 0.22152897]
[0.08137654 0.21940732]
[0.08132885 0.21927876]
[0.08132649 0.21927238]

In [738]:
final

      fun: 8603.726982003966
 hess_inv: <2x2 LbfgsInvHessProduct with dtype=float64>
      jac: array([-7891.64424038,  2926.90274518])
  message: 'CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH'
     nfev: 63
      nit: 7
     njev: 21
   status: 0
  success: True
        x: array([0.08132649, 0.21927238])

In [749]:
print("The Value for n is ",final.x[0]," and Alpha is ",final.x[1])
print("The Value of Maximum Log likelihood is ",-1*final.fun)
print('The values are similar to the values obtained when using book1.csv')

The Value for n is  0.08134118622615552  and Alpha is  0.21923404867443047
The Value of Maximum Log likelihood is  -8603.49884703562
The values are similar to the values obtained when using book1.csv

<b> 6. Calculate the values of (i) reach, (ii) average frequency, and (iii) gross ratings points (GRPs) based on the
NBD model. Show your work.

reach for the NBD model is defined as 100*(1-P(x=0|n,alpha)), alpha value obtained after the MLE implementation is 0.2566150324283152 and n is  1.1846549361700596

In [750]:
params = np.array([1,1])
inputs=bk1.copy()
inputs.columns=['Qty_Purchased','Number_of_People']

In [751]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [752]:
def NBDLL(params,inputs):
    e=inputs['Qty_Purchased']
    p=inputs['Number_of_People']
    n=params[0]
    alpha=params[1]
    sum=0
    for i in range(len(inputs)):
        sum+=pmf_nbd(alpha,n,e[i],1)*p[i]
    return sum

In [753]:
def NLL(params, inputs):
    return(-(NBDLL(params, inputs)))

def p_callback(params):
    print(params)

In [754]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None),(0.000001, None)],callback=p_callback)

[0.9996994  1.35725779]
[0.14907399 0.40179165]
[0.0979495 0.2639978]
[0.08217807 0.22148967]
[0.08139086 0.21936793]
[0.08134365 0.2192407 ]
[0.08134119 0.21923405]

In [755]:
print("The Value for n is ",final.x[0]," and Alpha is ",final.x[1])
print("The Value of Maximum Log likelihood is ",-1*final.fun)

The Value for n is  0.08134118622615552  and Alpha is  0.21923404867443047
The Value of Maximum Log likelihood is  -8603.49884703562

In [757]:
n=final.x[0]
alpha=final.x[1]
pmf_0=(alpha/(alpha+1))**n
reach = 100*(1-pmf_0)
print('reach is',reach)

reach is 13.026639691492758

In [758]:
reach

13.026639691492758

In [759]:
#reach is 18.9%

In [760]:
E_x= n/alpha

In [761]:
print('E(x) is ',E_x )

E(x) is  0.3710244221551086

In [762]:
Average_Frequency=E_x/(1-pmf_0)

In [763]:
grps= reach*Average_Frequency

In [764]:
print('reach is ',reach)
print('Average Frequency is' ,Average_Frequency)
print('grps is ',grps)

reach is  13.026639691492758
Average Frequency is 2.8481974702763266
grps is  37.10244221551086

<b> 7. Identify all independent variables with missing values. How many values are missing in each? Drop any variable
with many missing values (specify how you are defining ‘many’). If the number of missing values are very few
(again, specify how you are defining ‘few’), delete the rows involved. For the remaining variables (if any),
replace the missing values with the means of the corresponding variables. Report your code.

In [569]:
bk2

      education  region  hhsz   age  income  child  race  country  qty
1           2.0     4.0     1   6.0       5      0     1        0    0
2           5.0     4.0     4   5.0       6      0     1        0    0
3           NaN     2.0     2   6.0       3      0     1        0    0
4           4.0     4.0     5   4.0       7      1     1        0    0
5           5.0     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807        1.0     2.0     5  10.0       2      1     1        0    5
1808        NaN     3.0     4   8.0       4      1     1        0    2
1809        NaN     3.0     4   4.0       4      1     1        0    9
1810        NaN     4.0     6   8.0       6      1     1        0    2
1811        NaN     4.0     1  11.0       2      0     1        0    1

[9451 rows x 9 columns]

<b> Treating missing values

In [570]:
#below are the number of missing values by each column in the books table.
print('Below is the list of columns and the number of nulls in each colum')
bk2.isna().sum()

Below is the list of columns and the number of nulls in each colum

education    6914
region         11
hhsz            0
age             1
income          0
child           0
race            0
country         0
qty             0
dtype: int64

In [584]:
books_2 = pd.DataFrame(bk2, columns = ["education", "region", "hhsz","age","income","child","race","country","qty"])
books_2.head()

   education  region  hhsz   age  income  child  race  country  qty
1        2.0     4.0     1   6.0       5      0     1        0    0
2        5.0     4.0     4   5.0       6      0     1        0    0
3        NaN     2.0     2   6.0       3      0     1        0    0
4        4.0     4.0     5   4.0       7      1     1        0    0
5        5.0     3.0     1  10.0       3      0     1        1    0

In [585]:
books_2.isna().sum()

education    6914
region         11
hhsz            0
age             1
income          0
child           0
race            0
country         0
qty             0
dtype: int64

In [586]:
#below is the summary of the education variable
books_2.education.describe()

count    2537.000000
mean        2.749310
std         1.430923
min         0.000000
25%         1.000000
50%         2.000000
75%         4.000000
max         5.000000
Name: education, dtype: float64

In [587]:
#imputing the mean of education in the education column instead of deleting it 
#since the proportion of missing values to the total rows is high
books_3=books_2.copy()
books_3.education.fillna(books_3.education.mean(), inplace = True)
books_3.head()

   education  region  hhsz   age  income  child  race  country  qty
1    2.00000     4.0     1   6.0       5      0     1        0    0
2    5.00000     4.0     4   5.0       6      0     1        0    0
3    2.74931     2.0     2   6.0       3      0     1        0    0
4    4.00000     4.0     5   4.0       7      1     1        0    0
5    5.00000     3.0     1  10.0       3      0     1        1    0

In [588]:
books_3.isna().sum()

education     0
region       11
hhsz          0
age           1
income        0
child         0
race          0
country       0
qty           0
dtype: int64

In [589]:
#deleting the nulls rows which have nulls in the region column since we have only 46 rows 
#which is negligible compared to the entire data set
books_3 = books_3.dropna(axis=0, subset=['region'])

In [590]:
books_3.isna().sum()

education    0
region       0
hhsz         0
age          1
income       0
child        0
race         0
country      0
qty          0
dtype: int64

In [591]:
#deleting the nulls rows which have nulls in the age column since we have only 46 rows 
#which is negligible compared to the entire data set
books_3 = books_3.dropna(axis=0, subset=['age'])

In [592]:
books_3.isna().sum()

education    0
region       0
hhsz         0
age          0
income       0
child        0
race         0
country      0
qty          0
dtype: int64

In [593]:
books_3

      education  region  hhsz   age  income  child  race  country  qty
1       2.00000     4.0     1   6.0       5      0     1        0    0
2       5.00000     4.0     4   5.0       6      0     1        0    0
3       2.74931     2.0     2   6.0       3      0     1        0    0
4       4.00000     4.0     5   4.0       7      1     1        0    0
5       5.00000     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807    1.00000     2.0     5  10.0       2      1     1        0    5
1808    2.74931     3.0     4   8.0       4      1     1        0    2
1809    2.74931     3.0     4   4.0       4      1     1        0    9
1810    2.74931     4.0     6   8.0       6      1     1        0    2
1811    2.74931     4.0     1  11.0       2      0     1        0    1

[9439 rows x 9 columns]

In [598]:
bk3=books_3

In [599]:
bk3

      education  region  hhsz   age  income  child  race  country  qty
1       2.00000     4.0     1   6.0       5      0     1        0    0
2       5.00000     4.0     4   5.0       6      0     1        0    0
3       2.74931     2.0     2   6.0       3      0     1        0    0
4       4.00000     4.0     5   4.0       7      1     1        0    0
5       5.00000     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807    1.00000     2.0     5  10.0       2      1     1        0    5
1808    2.74931     3.0     4   8.0       4      1     1        0    2
1809    2.74931     3.0     4   4.0       4      1     1        0    9
1810    2.74931     4.0     6   8.0       6      1     1        0    2
1811    2.74931     4.0     1  11.0       2      0     1        0    1

[9439 rows x 9 columns]

<b> 8. Incorporate the available customer characteristics and estimate all relevant parameters for Poisson regression
using MLE. Report your code, the estimated parameters and the maximum value of the log-likelihood (and any
other information you believe is relevant). What are the managerial takeaways — which customer characteristics
seem to be important?

In [765]:
inputs=bk3.copy()

In [766]:
bk3

      education  region  hhsz   age  income  child  race  country  qty
1       2.00000     4.0     1   6.0       5      0     1        0    0
2       5.00000     4.0     4   5.0       6      0     1        0    0
3       2.74931     2.0     2   6.0       3      0     1        0    0
4       4.00000     4.0     5   4.0       7      1     1        0    0
5       5.00000     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807    1.00000     2.0     5  10.0       2      1     1        0    5
1808    2.74931     3.0     4   8.0       4      1     1        0    2
1809    2.74931     3.0     4   4.0       4      1     1        0    9
1810    2.74931     4.0     6   8.0       6      1     1        0    2
1811    2.74931     4.0     1  11.0       2      0     1        0    1

[9439 rows x 9 columns]

In [767]:
params = np.array([1,1,1,1,1,1,1,1,1])

In [768]:
def LL(params,inputs):
    k=inputs['qty'].tolist()
    kc1=inputs.drop(['qty'],axis=1)
    a=kc1.to_numpy().tolist()
    beta=params
    lambda0=beta[8]
    beta=np.delete(beta, [8])
    lambdai=0
    sum2=0
    sum1=0
    for i in range(len(a)):
        sum1=0
        for j in range(len(a[i])):
            sum1=sum1+beta[j]*a[i][j]
        lambdai=lambda0*np.exp(sum1)
        sum2=sum2+poisson_pmf(k[i],lambdai)
    return sum2

In [769]:
def NLL(params, inputs):
    return(-1*(LL(params, inputs)))

In [770]:
final=minimize(NLL,
         args=inputs,
         x0=params,
         bounds=[(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None),(0.000001, None)],callback=p_callback)

[0.66666667 0.66666667 0.66666667 0.66666667 0.66666667 0.66666667
 0.66666667 0.66666667 0.66666667]
[0.65314381 0.65321818 0.65338741 0.65294012 0.65282299 0.65287473
 0.65316911 0.65312421 0.65163125]
[0.62711426 0.62738249 0.62791008 0.62656962 0.62616393 0.62627598
 0.6272005  0.62705196 0.62213998]
[0.60600077 0.60647869 0.60732939 0.60524451 0.60453898 0.60465152
 0.60614687 0.60589678 0.59764191]
[0.58291482 0.58367984 0.5849187  0.58201455 0.58090744 0.58095622
 0.58313458 0.58275443 0.57020062]
[0.56049853 0.56160369 0.56325652 0.55956759 0.55799027 0.55789686
 0.56079472 0.56026805 0.54282981]
[0.53772315 0.53923933 0.54135332 0.53689691 0.53475304 0.53441458
 0.53809739 0.5373999  0.51419944]
[0.51498783 0.5169833  0.51960256 0.51443213 0.51162432 0.51091691
 0.51543435 0.51454227 0.48468518]
[0.4921426  0.49469203 0.49786969 0.49206084 0.48847576 0.48724393
 0.492648   0.49153351 0.45395065]
[0.46925605 0.47243571 0.47623088 0.46989456 0.46540608 0.4634589
 0.46979588 0.46842791 0.42190157]
[0.44632061 0.45020942 0.45469119 0.44798008 0.44244271 0.43954266
 0.44685573 0.44519774 0.38828893]
[0.42336197 0.42804186 0.43330154 0.42644176 0.41966531 0.41548579
 0.42382253 0.42182379 0.35279047]
[0.40041352 0.4059669  0.41211612 0.40541822 0.39716919 0.39128898
 0.40069607 0.39829158 0.31500089]
[0.37753689 0.38404445 0.39122301 0.38511935 0.37510027 0.36696354
 0.37748832 0.37459118 0.27436615]
[0.35483032 0.36236733 0.37075509 0.36585982 0.35367554 0.34252878
 0.35422223 0.35071114 0.23007878]
[0.33245818 0.3410881  0.35092577 0.34814393 0.33323882 0.31801832
 0.33094113 0.32663773 0.18089346]
[0.31069529 0.32045812 0.33208651 0.33282758 0.31435985 0.29347556
 0.3077113  0.30233584 0.12471444]
[0.28998078 0.300872   0.31481867 0.32146929 0.2980239  0.26888758
 0.28457556 0.27764999 0.0575335 ]
[0.28036457 0.29178155 0.30736324 0.31926776 0.29194678 0.25627461
 0.27283779 0.26467369 0.02868167]
[0.27611017 0.28776045 0.30414656 0.31871506 0.28946967 0.25052156
 0.26750213 0.25871511 0.01431062]
[0.27278881 0.2846179  0.30166807 0.31846934 0.28762673 0.24594811
 0.26327045 0.25396082 0.00238119]
[0.27252238 0.28436369 0.30147217 0.31847664 0.28749071 0.24556739
 0.26292038 0.25356245 0.00132044]
[0.27239925 0.28424595 0.30138214 0.31848414 0.28742969 0.24538942
 0.26275703 0.25337585 0.00081622]
[0.27235011 0.28419886 0.30134631 0.31848808 0.28740574 0.24531787
 0.26269144 0.25330074 0.00061177]
[0.27234289 0.28419186 0.3013408  0.31848777 0.28740175 0.24530757
 0.26268202 0.25328999 0.00058347]
[0.27234448 0.28419335 0.30134181 0.31848698 0.28740218 0.24531009
 0.26268432 0.25329269 0.00059149]
[0.27234214 0.28419079 0.30133899 0.31848263 0.28739864 0.245308
 0.2626824  0.25329083 0.00059077]
[0.27230859 0.28415395 0.30129781 0.31841723 0.28734639 0.24527888
 0.26265559 0.2532653  0.00058617]
[0.27222821 0.28406547 0.3011984  0.31825754 0.28721961 0.24520998
 0.26259214 0.25320526 0.00058136]
[0.27197216 0.2837833  0.30088061 0.31774427 0.28681334 0.2449918
 0.26239123 0.25301573 0.00057516]
[0.27128094 0.28302103 0.300021   0.31635181 0.28571296 0.24440472
 0.26185063 0.25250659 0.00057179]
[0.26935465 0.28089595 0.29762277 0.31246072 0.28264079 0.24277162
 0.26034681 0.25109159 0.00058309]
[0.26464541 0.27569955 0.29175587 0.30293255 0.27512197 0.23878349
 0.2566744  0.247638   0.00064089]
[0.25766153 0.26799168 0.28305027 0.28878291 0.26396121 0.23287428
 0.25123303 0.24252318 0.00076332]
[0.25227587 0.26204465 0.27632922 0.27784433 0.25533964 0.22832335
 0.24704292 0.23858698 0.00090307]
[0.24592768 0.25502575 0.26838751 0.26488853 0.2451418  0.22296998
 0.24211624 0.23396275 0.00115958]
[0.24108173 0.24965426 0.2622953  0.25490187 0.23730238 0.21890108
 0.23837488 0.23045758 0.00151239]
[0.2349927  0.24289922 0.25462826 0.24231536 0.22743022 0.21379495
 0.23368123 0.22606256 0.00201709]
[0.2257572  0.23265053 0.24299392 0.22321031 0.21244778 0.20605171
 0.2265645  0.21939882 0.00280563]
[0.22183194 0.22825828 0.23802489 0.21513747 0.20608148 0.20269049
 0.22349549 0.21648489 0.00400756]
[0.20860676 0.21357277 0.22138291 0.1879274  0.18469273 0.19153262
 0.21325069 0.20685639 0.00549217]
[0.20128708 0.20541546 0.21214261 0.17285502 0.17283013 0.18532433
 0.20756447 0.20149108 0.00687013]
[0.19991664 0.20280707 0.20816729 0.16346264 0.16666068 0.18558303
 0.20806657 0.20243872 0.0105833 ]
[0.18185474 0.18201313 0.18399291 0.12228081 0.1349829  0.17112744
 0.19499042 0.19038619 0.01588832]
[0.1853816  0.18573662 0.18806619 0.12858119 0.14008242 0.17429863
 0.1979533  0.19322611 0.01576877]
[0.1849073  0.18429736 0.18571307 0.12287551 0.13636593 0.17485234
 0.19870314 0.19421035 0.01835051]
[0.17868884 0.17515837 0.17360175 0.09858022 0.11912577 0.17191949
 0.19660266 0.19290943 0.02553877]
[0.17368738 0.15718646 0.15282453 0.08461923 0.09853217 0.16846529
 0.19727596 0.19053535 0.03411093]
[0.17408415 0.13837155 0.13282431 0.08790421 0.08474243 0.16744676
 0.20249296 0.18929711 0.04121439]
[0.17783756 0.10447073 0.09788163 0.10381549 0.06445274 0.16707704
 0.21436591 0.18774588 0.05294923]
[0.17941201 0.06264001 0.05427304 0.11390227 0.03614742 0.16513208
 0.22648905 0.18488271 0.06817257]
[0.1843933  0.03964024 0.03460976 0.12627489 0.03195504 0.16733482
 0.23751508 0.18432559 0.075304  ]
[0.18685537 0.02173333 0.01879704 0.13014129 0.02640766 0.16869067
 0.24522116 0.18390223 0.08178689]
[0.2318019  0.02815922 0.01283846 0.04682877 0.00885186 0.24570811
 0.32727145 0.26366638 0.12130697]
[2.02714813e-01 1.00000000e-06 3.10079897e-03 7.79896028e-02
 3.52110171e-02 2.13974381e-01 2.98275766e-01 2.20693321e-01
 1.15622777e-01]
[1.89280793e-01 1.00000000e-06 7.99865268e-03 7.69554350e-02
 4.79307817e-02 2.05596419e-01 2.86770215e-01 2.08186422e-01
 1.16158834e-01]
[1.27112852e-01 1.00000000e-06 2.34119120e-02 6.78890058e-02
 8.83167261e-02 1.64684121e-01 2.31960180e-01 1.51702301e-01
 1.26091633e-01]
[4.66906327e-02 1.00000000e-06 4.87637588e-02 7.94747714e-02
 7.89131859e-02 9.24713087e-02 1.40230613e-01 6.50886475e-02
 1.52278578e-01]
[0.02843342 0.00019498 0.05881495 0.0762761  0.07684996 0.08014433
 0.12290632 0.04673461 0.16622382]
[5.81588411e-03 1.00000000e-06 6.52483567e-02 7.41138419e-02
 6.30408443e-02 6.92148632e-02 1.12163234e-01 1.50524377e-02
 2.10483141e-01]
[1.00000000e-06 1.00000000e-06 7.77897172e-02 6.01771481e-02
 3.47596484e-02 5.06539051e-02 8.90854778e-02 1.00000000e-06
 2.75257475e-01]
[1.00000000e-06 1.00000000e-06 5.12129707e-02 4.70051254e-02
 3.08518809e-02 4.65317659e-02 8.54123077e-02 1.00000000e-06
 3.21112769e-01]
[1.15003688e-02 1.00000000e-06 2.24355653e-02 5.03369889e-02
 3.13589638e-02 4.60305814e-02 9.59129941e-02 1.00000000e-06
 3.58348863e-01]
[1.34504424e-02 1.00000000e-06 2.43094265e-03 3.60792240e-02
 2.88378451e-02 4.00438517e-02 9.03770814e-02 1.00000000e-06
 4.11025773e-01]
[1.29684371e-02 1.00000000e-06 5.57277520e-03 3.45507078e-02
 2.94837376e-02 3.87328462e-02 8.85445604e-02 1.00000000e-06
 4.16293227e-01]
[1.12052105e-02 1.00000000e-06 1.14805086e-02 2.66797247e-02
 2.80664101e-02 3.03337788e-02 7.78345953e-02 1.00000000e-06
 4.52585105e-01]
[4.24179228e-03 1.00000000e-06 1.39847948e-02 2.35369081e-02
 2.45620530e-02 1.46123515e-02 5.68382710e-02 1.00000000e-06
 4.94073954e-01]
[3.90517570e-03 1.00000000e-06 1.32057479e-02 2.68269324e-02
 2.26124980e-02 1.34525628e-02 5.23267632e-02 1.00000000e-06
 4.99298747e-01]
[1.00000000e-06 1.00000000e-06 1.31155216e-02 2.57052345e-02
 2.10950159e-02 7.35039843e-03 4.36366675e-02 1.00000000e-06
 5.13946542e-01]
[1.00000000e-06 1.00000000e-06 3.22168259e-03 2.70603112e-02
 1.48381276e-02 1.00000000e-06 2.91579747e-02 1.00000000e-06
 5.52611828e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.39657574e-02
 1.37673807e-02 1.00000000e-06 1.00000000e-06 1.00000000e-06
 5.96992649e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.36137496e-02
 1.55406840e-02 4.10588117e-03 1.00000000e-06 1.00000000e-06
 5.90742849e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.42975495e-02
 2.18629004e-02 2.54215110e-02 1.00000000e-06 1.00000000e-06
 5.57326105e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.58071387e-02
 2.13706467e-02 3.10110124e-02 1.00000000e-06 1.00000000e-06
 5.49826532e-01]

[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.82132300e-02
 1.82492694e-02 4.24980160e-02 1.00000000e-06 1.00000000e-06
 5.44561251e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.82647008e-02
 1.68242992e-02 4.94179108e-02 1.00000000e-06 1.00000000e-06
 5.45352117e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.68031636e-02
 1.57907725e-02 5.91698138e-02 1.00000000e-06 1.00000000e-06
 5.50013351e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.60713660e-02
 1.58603491e-02 6.05334214e-02 1.00000000e-06 1.00000000e-06
 5.52787997e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.59178037e-02
 1.59945173e-02 6.02361216e-02 1.00000000e-06 1.00000000e-06
 5.53071019e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.58954220e-02
 1.60173675e-02 6.00616017e-02 1.00000000e-06 1.00000000e-06
 5.53144174e-01]
[1.00000000e-06 1.00000000e-06 1.00000000e-06 2.58948978e-02
 1.60185434e-02 6.00522527e-02 1.00000000e-06 1.00000000e-06
 5.53149828e-01]

In [771]:
print("The Value for lambda is",final.x[8])
print("The values for the beta parameters are",final.x[0:8])
print("The Value of Maximum Log likelihood is ",-1*final.fun)

The Value for lambda is 0.553149828274452
The values for the beta parameters are [1.00000000e-06 1.00000000e-06 1.00000000e-06 2.58948978e-02
 1.60185434e-02 6.00522527e-02 1.00000000e-06 1.00000000e-06]
The Value of Maximum Log likelihood is  -18884.638464333206

<b>9. Estimate all relevant parameters for NBD regression using MLE. Report your code, the estimated parameters
and the maximum value of the log-likelihood (and any other information you believe is relevant). What are
the managerial takeaways — which customer characteristics seem to be important?

In [772]:
params = np.array([0.01,0.01,0.1,0.01,0.01,0.01,0.01,0.01,0.01,0.01])

In [773]:
pmf_nbd=lambda a,n,k,t: (np.log(gamma(n+k))-(np.log(gamma(n))+np.log(factorial(k))))+(n*(np.log(a)-np.log(a+t)))+(k*(np.log(t)-np.log(a+t)))

In [787]:
inputs=bk3.copy()
inputs

      education  region  hhsz   age  income  child  race  country  qty
1       2.00000     4.0     1   6.0       5      0     1        0    0
2       5.00000     4.0     4   5.0       6      0     1        0    0
3       2.74931     2.0     2   6.0       3      0     1        0    0
4       4.00000     4.0     5   4.0       7      1     1        0    0
5       5.00000     3.0     1  10.0       3      0     1        1    0
...         ...     ...   ...   ...     ...    ...   ...      ...  ...
1807    1.00000     2.0     5  10.0       2      1     1        0    5
1808    2.74931     3.0     4   8.0       4      1     1        0    2
1809    2.74931     3.0     4   4.0       4      1     1        0    9
1810    2.74931     4.0     6   8.0       6      1     1        0    2
1811    2.74931     4.0     1  11.0       2      0     1        0    1

[9439 rows x 9 columns]

In [775]:
def NBDLL(params,inputs):
    k=inputs['qty'].tolist()
    kc1=inputs.drop(['qty'],axis=1)
    a=kc1.to_numpy().tolist()
    beta=params
    alpha=beta[9]
    n=beta[8]
    beta=np.delete(beta, [9])
    beta=np.delete(beta, [8])
    lambdai=0
    sum2=0
    sum1=0
    for i in range(len(a)):
        sum1=0
        for j in range(len(a[i])):
            sum1=sum1+beta[j]*a[i][j]
        t=math.exp(sum1)
        sum2=sum2+pmf_nbd(alpha,n,k[i],t)
    return sum2

In [776]:
def NegLL(params, inputs):
    return(-(NBDLL(params, inputs)))

In [777]:
final=minimize(NegLL,
         args=inputs,
         x0=params,
         bounds=[(None, None), (None, None), (None, None), (None, None),(None, None), (None, None), (None, None), (None, None),(0.000001, None),(0.000001, None)])

In [778]:
print("The Value for n is ",final.x[8]," and Alpha is ",final.x[9])
print("The values for the beta parameters are",final.x[0:8])
print("The Value of Maximum Log likelihood is ",-1*final.fun)

The Value for n is  0.09835769568046158  and Alpha is  0.0785426592415001
The values for the beta parameters are [-0.12936605 -0.09999939 -0.0030107   0.02986125  0.01733193  0.05690244
 -0.21812761 -0.06818342]
The Value of Maximum Log likelihood is  -8355.151876290514